// 年度ごとの選手リスト
const playerList = {
  "2025": [
    "愛野ユキ","芦田美歩","荒井優希","伊藤麻希","上原わかな","遠藤有栖",
    "風城ハル","上福ゆき","キラ・サマー","桐生真弥","鈴木志乃","鈴芽",
    "高見汐珠","辰巳リカ","凍雅","鳥喰かや","中島翔子","七瀬千花",
    "猫はるな","ハイパーミサヲ","原宿ぽむ","HIMAWARI","瑞希",
    "宮本もか","山下実優","らく","渡辺未詩","難波小百合"
  ],

  "2024": [
    "愛野ユキ","荒井優希","伊藤麻希","上原わかな","遠藤有栖","大久保琉那",
    "角田奈穂","風城ハル","上福ゆき","桐生真弥","鈴木志乃","鈴芽",
    "辰巳リカ","凍雅","鳥喰かや","中島翔子","猫はるな","ハイパーミサヲ",
    "原宿ぽむ","HIMAWARI","瑞希","宮本もか","山下実優","らく",
    "渡辺未詩","難波小百合"
  ],

  "2023": [
    "愛野ユキ","荒井優希","伊藤麻希","遠藤有栖","角田奈穂","上福ゆき",
    "桐生真弥","坂崎ユカ","鈴芽","辰巳リカ","鳥喰かや","中島翔子",
    "長野じゅりあ","猫はるな","乃蒼ヒカリ","ハイパーミサヲ","原宿ぽむ",
    "瑞希","宮本もか","山下実優","らく","渡辺未詩","難波小百合","ふりーWiFi"
  ],

  "2023アンビシャス": [
    "荒井優希","伊藤麻希","上原わかな","大久保琉那","風城ハル","上福ゆき",
    "坂崎ユカ","鈴木志乃","鈴芽","辰巳リカ","凍雅","中島翔子","乃蒼ヒカリ",
    "ハイパーミサヲ","HIMAWARI","瑞希","山下実優","らく","渡辺未詩",
    "享楽共鳴","でじもん","アプガ"
  ],

  "2022": [
    "愛野ユキ","荒井優希","伊藤麻希","遠藤有栖","角田奈穂","上福ゆき",
    "桐生真弥","小橋マリカ","坂崎ユカ","沙希様","鈴芽","辰巳リカ",
    "天満のどか","鳥喰かや","中島翔子","猫はるな","乃蒼ヒカリ",
    "ハイパーミサヲ","原宿ぽむ","瑞希","宮本もか","メイサン",
    "山下実優","らく","渡辺未詩","難波小百合","マジラビ"
  ]
};

// 年度ごとのカード種別
const cardTypes = {
  "2025": ["パラレル", "シークレット", "インサート", "通常サイン", "シク版サイン", "インサートサイン", "スーパーシークレット"],
  "2024": ["パラレル", "シークレット", "インサート", "通常サイン", "シク版サイン", "インサートサイン", "スーパーシークレット"],
  "2023アンビシャス": ["シークレット", "桃", "インサート", "インサート40", "インサート20", "通常サイン", "シクサイン", "インサートサイン", "スーパーシークレット"],
  "2023": ["シークレット", "インサート", "通常サイン", "シク版サイン", "インサートサイン", "スーパーシークレット"],
  "2022": ["シークレット", "インサート", "通常サイン", "シク版サイン", "インサート銀", "スーパーシークレット"]
};